#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

/*
描述
    输入一个班级5个学生各5科成绩，输出5个学生各5科成绩及总分。
输入描述：
    五行，每行输入一个学生各5科成绩（浮点数表示，范围0.0~100.0），用空格分隔。
输出描述：
    五行，按照输入顺序每行输出一个学生的5科成绩及总分（小数点保留1位），用空格分隔。
*/

int main()
{
    double arr[5][6] = { 0 };//二维数组的最后一个存储前面5个的总和
    arr[0][5] = arr[1][5] = arr[2][5] = arr[3][5] = arr[4][5] = 0;//把最后的数据置为0

    int i = 0, j = 0;
    for (i = 0; i < 5; i++)
    {
        for (j = 0; j < 5; j++)
        {
            scanf("%lf", &arr[i][j]);//输入数据
            arr[i][5] += arr[i][j];//每行数据的累加
        }
    }

    for (i = 0; i < 5; i++)
    {
        for (j = 0; j < 6; j++)
        {
            printf("%.1lf\n", arr[i][j]);//打印
        }
        printf("\n");
    }
    return 0;
}