#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>


//求函数返回值，传入 - 1 ，则在64位机器上函数返回（C）
//int func(int x)
//{
//	int count = 0;
//	while (x)
//	{
//		count++;
//		x = x & (x - 1);//与运算
//	}
//	return count;
//}
//A: 死循环 B : 64 C : 32 D : 16

//-1
//10000000 00000000 00000000 00000001
//11111111 11111111 11111111 11111110
//11111111 11111111 11111111 11111111 --> 补码
//11111111 11111111 11111111 11111110 --> 补码 //-2
//11111111 11111111 11111111 11111110 --> 补码//-2
//-3
//11111111 11111111 11111111 11111101
//11111111 11111111 11111111 11111100
//11111111 11111111 11111111 11111011
//10000000 00000000 00000000 00000100
// 
//将x转化为2进制，看含有的1的个数 -->x & (x - 1)的作用
//代码验证

//int main()
//{
//	int len = func(-1);
//	printf("%d\n", len);//32
//	return 0;
//}



//读代码选结果（D）
//代码验证
//int main()
//{
//	int count = 0;
//	int x = -1;
//	while (x)
//	{
//		count++;
//		x = x >> 1;//注意：负数的右移高位还是补1，所以是无限死循环
//	}
//	printf("%d", count);
//	return 0;
//}
//A: 1 B: 2 C: 32 D: 死循环，没结果



//下述赋值语句错误的是（C）
//A: a = (b = (c = 2, d = 3)) 
//B : i++ 
//C : a / b = 2 //注意，运算只能在右值进行操作，而不能在左值进行操作
//D : a = a < a + 1



//若有 int w = 1, x = 2, y = 3, z = 4; 
//则条件表达 w < x ? w : y < z ? y : z 的值是（A）
//A: 1 B : 2 C : 3 D : 4

//代码验证
//int main()
//{
//	int w = 1, x = 2, y = 3, z = 4;
//	int res = w < x ? w : y < z ? y : z;
//	printf("%d\n", res);//1
//	return 0;
//}


//以下程序运行后的输出结果是（A）
//int main()
//{
//	int a = 1, b = 2, m = 0, n = 0, k;
//	k = (n = b < a) && (m = a);
//	printf("%d,%d\n", k, m);// 0 0
//	return 0;
//}
//A: 0,0 B: 0,1 C: 1,0 D: 1,1


//描述
//写一个函数，求两个整数之和，要求在函数体内不得使用 + 、 - 、 * 、 / 四则运算符号。
//数据范围：两个数都满足−10≤n≤1000

/**
 * 代码中的类名、方法名、参数名已经指定，请勿修改，直接返回方法规定的值即可
 *
 *
 * @param num1 int整型
 * @param num2 int整型
 * @return int整型
 */
int Add(int num1, int num2)
{
    // int m = num1 & num2;
    // int n = num1 | num2;
    // return m + n;

    return num1 + num2;
}