#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//请阅读以下程序，其运行结果是（A）
//int main()
//{
//	char c = 'A';
//	if ('0' <= c <= '9') printf("YES");//YES
//	else printf("NO");
//	//分析：'0' < 'A'为真->1  1 <= '9' --> 真（1）
//	return 0;
//}

//A: YES B: NO C: YESNO D: 语句错误



//假设编译器规定 int 和 short 类型长度分别为32位和16位，
//若有下列C语言语句，则 y 的机器数为（B）
//unsigned short x = 65530;
//unsigned int y = x;
//分析：11111111 11111010 ：65530
//		00000000 00000000 11111111 11111010 ：y
//A: 0000 7FFA 
//B: 0000 FFFA 
//C: FFFF 7FFA 
//D: FFFF FFFA

//代码验证
//int main()
//{
//	unsigned short x = 65530;
//	unsigned int y = x;
//	printf("%x\n", y);
//	return 0;
//}



//下列程序的输出结果是什么（B）
//#include<stdio.h>
//int main()
//{
//	int n = 1001;
//	int ans = 0;
//
//	for (int i = 1; i <= n; ++i)
//	{
//		//0和任何数异或，等于它本身1
//		ans ^= (i % 3);//ans = ans ^ i % 3;
//	}
//	//00000000 00000000 00000000 00000000 - 0
//	//00000000 00000000 00000000 00000001 - 1
//	//00000000 00000000 00000000 00000001 - 1 0和1异或
//	
//	//00000000 00000000 00000000 00000001 - 1
//	//00000000 00000000 00000000 00000010 - 2
//	//00000000 00000000 00000000 00000011 - 3 1和2异或
//	
//	//00000000 00000000 00000000 00000011 - 3
//	//00000000 00000000 00000000 00000000 - 0
//	//00000000 00000000 00000000 00000011 - 3
//
//	//00000000 00000000 00000000 00000011 - 3
//	//00000000 00000000 00000000 00000001 - 1
//	//00000000 00000000 00000000 00000010 - 2
//	
//	//00000000 00000000 00000000 00000010 - 2
//	//00000000 00000000 00000000 00000010 - 2
//	//00000000 00000000 00000000 00000000 - 0
//	printf("%d", ans);
//	return 0;
//}

//A: -2 B: 0 C: 1 D: 2




//C 语言中，下列运算符优先级最高的是 (A)
//A: !B : % C : >> D : ==
//分析：在上面的运算符中，单目运算符的优先级最高



//要使 a 的低四位翻转，需要进行操作是（C）
//A: a | 0xF B : a & 0xF C : a ^ 0xF D : ~a
//A: 0xF:1111-->错误，如果a中有1则无法翻转
//B: 0xF:1111-->错误，如果a中有1则无法翻转
//C: 0xF:1111-->正确，如果a中有1则变0，有0则变1
//D: ~a把a的所有位都取反





/*
描述
    输入一个整数，将这个整数以字符串的形式逆序输出
    程序不考虑负数的情况，若数字含有0，则逆序形式也含有0，
    如输入为100，则输出为001
数据范围：
    0≤n≤2^30−1
输入描述：
    输入一个int整数
输出描述：
    将这个整数以字符串的形式逆序输出
*/

//#include <stdio.h>
//#include <stdlib.h>
//
//char* reverse(int num)
//{
//    char* arr = (char*)malloc(sizeof(char) * 15);//申请空间
//    int count = 0;
//
//    //特殊情况
//    if (num == 0)
//    {
//        arr[0] = '0';
//        return arr;
//    }
//
//    //循环得到num的个数
//    while (num != 0)
//    {
//        int tmp = num % 10;
//        arr[count] = tmp + '0';//把值加入到字符串中
//        count++;
//        num /= 10;
//    }
//    return arr;
//}
//
//int main()
//{
//    int num = 0;
//    scanf("%d", &num);
//
//    char* arr = reverse(num);
//    printf("%s\n", arr);
//    return 0;
//}


//字符串逆序
//#include <stdio.h>
//#include <string.h>
//
//void reverse(char* arr, int len)
//{
//    char tmp;
//    for (int i = 0; i < len / 2; i++)
//    {
//        tmp = arr[i];
//        arr[i] = arr[len - i - 1];
//        arr[len - i - 1] = tmp;
//    }
//}
//
//int main()
//{
//    char arr[1000] = { 0 };
//    gets(arr);
//
//    int len = strlen(arr);
//    reverse(arr, len);
//    printf("%s", arr);
//
//    return 0;
//}


/*
描述
对字符串中的所有单词进行倒排。

说明：
    1、构成单词的字符只有26个大写或小写英文字母；
    2、非构成单词的字符均视为单词间隔符；
    3、要求倒排后的单词间隔符以一个空格表示；
    如果原字符串中相邻单词间有多个间隔符时，
    倒排转换后也只允许出现一个空格间隔符；
    4、每个单词最长20个字母；
数据范围：
    字符串长度满足1≤n≤10000
输入描述：
    输入一行，表示用来倒排的句子
输出描述：
    输出句子的倒排结果
*/

#include <stdio.h>
#include <string.h>

int main()
{
    char ch = 0;
    //每一维存储每个的单词
    char word[100][21] = { 0 };
    int row = 0;//行
    int col = 0;//列

    while ((ch = getchar())!=EOF)
    {
        //判断是不是合格字符
        if ((ch >= 'a' && ch <= 'z') || (ch >= 'A' && ch <= 'Z'))
            word[row][col++] = ch;
        else
        {
            row++;//行加1
            col = 0;//重置，开始储存下一个字符串
        }
        if (ch == '\n')
            break;
    }

    //逆序打印
    for (int i = row - 1; i >= 0; i--)
    {
        printf("%s ", word[i]);
    }

    return 0;
}